app/Controllers/Admin/TicketController.php

    public function index()
    {
        $db = \Config\Database::connect();
        $total = $db->table('tickets')->countAll();
        $tickets2 = model('Ticket');

        $builder = $db->table('status');
        $builder->join('tickets', 'tickets.status=status.id');
        $status = $builder->get();
        // $status = $builder->where('status.id', 'ASC')->get();

        $builder2 = $db->table('areas')->select('areas.name');
        $builder2->join('users', 'users.area = areas.id');
        $builder2->join('tickets', 'users.id = tickets.usuario');
        $usuario = $builder2->get();

        $this->session = \Config\Services::session();

        $builder3 = $this->db->table('tickets as t');
        $builder3->select('t.*, user.name, user.apaterno, user.amaterno, a.name as nombrearea, status.name as estado');
        $builder3->join('users as user', 't.usuario = user.id');
        $builder3->join('areas as a', 'user.area = a.id');
        $builder3->join('status', 't.status = status.id');
        $tickets = $builder3->get()->getResult();

        $data = [
            'title'     => 'Tickets de soporte',
            'total'     => $total,
            'status'    => $status,
            // // 'tickets'   => $tickets->findAll(),
            // 'tickets'   => $tickets->orderBy('status', 'ASC')->findAll()
            'tickets2'   => $tickets2->orderBy('id', 'desc')->findAll(),
            'usuario'   => $usuario,
            'tickets' => $tickets
        ];
---
SELECT COUNT(*) AS `numrows` FROM `tickets`
SELECT *
FROM `status`
JOIN `tickets` ON `tickets`.`status`=`status`.`id`
SELECT `areas`.`name`
FROM `areas`
JOIN `users` ON `users`.`area` = `areas`.`id`
JOIN `tickets` ON `users`.`id` = `tickets`.`usuario`
SELECT `t`.*, `user`.`name`, `user`.`apaterno`, `user`.`amaterno`, `a`.`name` as `nombrearea`, `status`.`name` as `estado`
FROM `tickets` as `t`
JOIN `users` as `user` ON `t`.`usuario` = `user`.`id`
JOIN `areas` as `a` ON `user`.`area` = `a`.`id`
JOIN `status` ON `t`.`status` = `status`.`id`
SELECT *
FROM `tickets`
ORDER BY `id` DESC

    public function show($id = null)
    {
        $ticket = $this->ticket->find($id);
        if ($ticket) {

            $builder = $this->db->table("status as s");
            $builder->select('s.name');
            $builder->join('tickets as t', 's.id = t.status');
            $st = $builder->get()->getResult();
---
SELECT *
FROM `tickets`
WHERE `tickets`.`id` = '22'
SELECT `s`.`name`
FROM `status` as `s`
JOIN `tickets` as `t` ON `s`.`id` = `t`.`status`